In [4]:
import sqlite3

In [3]:
db = sqlite3.connect('IMDB.sqlite')
db

In [19]:
db = sqlite3.connect('room.sqlite')
db

In [20]:
cur = db.cursor()
cur

In [21]:
sql_query = 'Create table room(rollnumber int primary key, name text, age int)'
cur.execute(sql_query)

In [22]:
cur.execute('Insert into room values(1012,"siddhu",24)')

In [23]:
db.commit()

In [37]:
db = sqlite3.connect('Employee.sqlite')
db

In [38]:
cur = db.cursor()
cur

In [29]:
a = 'Create table employee(employeeid int primary key, name text , age int , department text, salary text)'
cur.execute(a)

In [31]:
b = 'Insert into employee values(100,"Rishav",25,"Marketing",50000), (101,"abhishek", 26, "Operations", 600000),(102,"Aman",24, "Human Resource", 75000)'
cur.execute(b)

In [32]:
db.commit()

In [7]:
idd = 103
name = "siddhu"
ag   = 19
dep = "testing"
salary = 1000
cur.execute('Insert into employee values(?,?,?,?,?)',(idd,name,ag,dep,salary))

In [9]:
db.commit()

In [10]:
cur.execute('Update employee set salary = 1000000 where name = "siddhu"')

In [11]:
db.commit()

In [13]:
db.execute('delete from employee where employeeid = 101')

In [14]:
db.commit()

In [17]:
emid = 102
db.execute('delete from employee where employeeid = ?',(emid,))

In [18]:
db.commit()

In [20]:
db.execute('delete from employee where employeeid = 103')
db.execute('delete from employee where employeeid = 104')

In [26]:
db.execute('delete from employee')

In [27]:
db.commit()

In [28]:
## Open and read data file as specified in the question
## Print the required output in given format
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]
for i in range(len(name))
    db.execute('insert into employee values(?,?,?,?,?)',(employee_id[i],name[i],age[i],department[i],salary[i]))
    db.commit()
print('done')

done

In [34]:
db = sqlite3.connect('school.sqlite')
cur = db.cursor()

In [39]:
cur.execute('Select * from employee')

In [40]:
for i in cur:
    print(i)

(101, 'Aadarsh', 25, 'Marketing', '50000')
(102, 'Aarti', 27, 'Operations', '60000')
(103, 'Siddharth', 25, 'Finance', '85000')
(104, 'Aman', 24, 'Human Resource', '75000')
(105, 'Amit', 30, 'Marketing', '50000')
(106, 'Shivansh', 26, 'IT', '90000')
(107, 'Vaibhav', 23, 'Finance', '85000')
(108, 'Himanshu', 26, 'IT', '90000')
(109, 'Raman', 25, 'Operations', '60000')
(110, 'Kunal', 26, 'Marketing', '50000')
(111, 'Adhira', 29, 'Human Resource', '75000')
(112, 'Tanya', 24, 'Marketing', '50000')

In [41]:
cur.execute('select * from employee')
print(cur.fetchone())

(101, 'Aadarsh', 25, 'Marketing', '50000')

In [42]:
print(cur.fetchmany(3))#default value is 1

[(102, 'Aarti', 27, 'Operations', '60000'), (103, 'Siddharth', 25, 'Finance', '85000'), (104, 'Aman', 24, 'Human Resource', '75000')]

In [43]:
print(cur.fetchall())

[(105, 'Amit', 30, 'Marketing', '50000'), (106, 'Shivansh', 26, 'IT', '90000'), (107, 'Vaibhav', 23, 'Finance', '85000'), (108, 'Himanshu', 26, 'IT', '90000'), (109, 'Raman', 25, 'Operations', '60000'), (110, 'Kunal', 26, 'Marketing', '50000'), (111, 'Adhira', 29, 'Human Resource', '75000'), (112, 'Tanya', 24, 'Marketing', '50000')]

In [44]:
cur.execute('select * from employee where employeeid >105')

In [45]:
print(cur.fetchall())

[(106, 'Shivansh', 26, 'IT', '90000'), (107, 'Vaibhav', 23, 'Finance', '85000'), (108, 'Himanshu', 26, 'IT', '90000'), (109, 'Raman', 25, 'Operations', '60000'), (110, 'Kunal', 26, 'Marketing', '50000'), (111, 'Adhira', 29, 'Human Resource', '75000'), (112, 'Tanya', 24, 'Marketing', '50000')]

In [52]:
cur.execute('select count(*) from employee where department = "IT"')
print(cur.fetchall())

[(2,)]